---
type: StructuralSectionRoundBar
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionRoundBar

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionRoundBar | 2015 | `public StructuralSectionRoundBar ( double diameter , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight , double momentOfInertia` |